IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/GPIOA_1.0.xml
        <register id="GPIOA_INT_EVENT2_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="DIO16" description="DIO16 event" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO16 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO16 event occurred"/>
            </bitfield>
            <bitfield id="DIO17" description="DIO17 event" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO17 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO17 event occurred"/>
            </bitfield>
            <bitfield id="DIO18" description="DIO18 event" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO18 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO18 event occurred"/>
            </bitfield>
            <bitfield id="DIO19" description="DIO19 event" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO19 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO19 event occurred"/>
            </bitfield>
            <bitfield id="DIO20" description="DIO20 event" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO20 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO20 event occurred"/>
            </bitfield>
            <bitfield id="DIO21" description="DIO21 event" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO21 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO21 event occurred"/>
            </bitfield>
            <bitfield id="DIO22" description="DIO22 event" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO22 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO22 event occurred"/>
            </bitfield>
            <bitfield id="DIO23" description="DIO23 event" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO23 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO23 event occurred"/>
            </bitfield>
            <bitfield id="DIO24" description="DIO24 event" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO24 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO24 event occurred"/>
            </bitfield>
            <bitfield id="DIO25" description="DIO25 event" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO25 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO25 event occurred"/>
            </bitfield>
            <bitfield id="DIO26" description="DIO26 event" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO26 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO26 event occurred"/>
            </bitfield>
            <bitfield id="DIO27" description="DIO27 event" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO27 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO27 event occurred"/>
            </bitfield>
            <bitfield id="DIO28" description="DIO28 event" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO28 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO28 event occurred"/>
            </bitfield>
            <bitfield id="DIO29" description="DIO29 event" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO29 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO29 event occurred"/>
            </bitfield>
            <bitfield id="DIO30" description="DIO30 event" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO30 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO30 event occurred"/>
            </bitfield>
            <bitfield id="DIO31" description="DIO31 event" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO31 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO31 event occurred"/>
            </bitfield>
        </register>
        <register id="GPIOA_INT_EVENT2_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="DIO16" description="DIO16 event" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO16 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO16 event occurred"/>
            </bitfield>
            <bitfield id="DIO17" description="DIO17 event" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO17 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO17 event occurred"/>
            </bitfield>
            <bitfield id="DIO18" description="DIO18 event" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO18 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO18 event occurred"/>
            </bitfield>
            <bitfield id="DIO19" description="DIO19 event" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO19 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO19 event occurred"/>
            </bitfield>
            <bitfield id="DIO20" description="DIO20 event" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO20 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO20 event occurred"/>
            </bitfield>
            <bitfield id="DIO21" description="DIO21 event" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO21 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO21 event occurred"/>
            </bitfield>
            <bitfield id="DIO22" description="DIO22 event" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO22 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO22 event occurred"/>
            </bitfield>
            <bitfield id="DIO23" description="DIO23 event" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO23 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO23 event occurred"/>
            </bitfield>
            <bitfield id="DIO24" description="DIO24 event" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO24 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO24 event occurred"/>
            </bitfield>
            <bitfield id="DIO25" description="DIO25 event" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO25 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO25 event occurred"/>
            </bitfield>
            <bitfield id="DIO26" description="DIO26 event" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO26 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO26 event occurred"/>
            </bitfield>
            <bitfield id="DIO27" description="DIO27 event" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO27 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO27 event occurred"/>
            </bitfield>
            <bitfield id="DIO28" description="DIO28 event" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO28 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO28 event occurred"/>
            </bitfield>
            <bitfield id="DIO29" description="DIO29 event" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO29 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO29 event occurred"/>
            </bitfield>
            <bitfield id="DIO30" description="DIO30 event" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO30 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO30 event occurred"/>
            </bitfield>
            <bitfield id="DIO31" description="DIO31 event" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO31 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO31 event occurred"/>
            </bitfield>
        </register>
